7767517
250 303
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1728 9=1
Split                    splitncnn_0              1 2 1 2 3
Convolution              convrelu_1               1 1 2 4 0=32 1=2 11=2 12=1 13=1 2=1 3=1 4=-233 5=1 6=8192 9=1
Convolution              convrelu_2               1 1 4 5 0=64 1=2 11=2 12=1 13=1 2=1 3=1 4=-233 5=1 6=8192 9=1
Padding                  pad_128                  1 1 3 6 0=0 1=1 2=0 3=1 4=0 5=-3.402823e+38 6=0
Pooling                  maxpool2d_127            1 1 6 7 0=0 1=2 11=2 12=1 13=0 2=1 3=0 5=1
Concat                   cat_0                    2 1 7 5 8 0=0
Convolution              convrelu_3               1 1 8 9 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728 9=1
Convolution              convrelu_4               1 1 9 10 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192 9=1
ConvolutionDepthWise     convdw_151               1 1 10 11 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Split                    splitncnn_1              1 2 11 12 13
Reduction                mean_146                 1 1 13 14 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_5               1 1 14 15 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096 9=1
Convolution              conv_6                   1 1 15 16 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
HardSigmoid              hsigmoid_116             1 1 16 17 0=0.166667 1=0.5
BinaryOp                 mul_0                    2 1 12 17 18 0=2
Split                    splitncnn_2              1 2 18 19 20
Convolution              conv_7                   1 1 20 21 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
GELU                     gelu_103                 1 1 21 22
Convolution              conv_8                   1 1 22 23 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_1                    2 1 19 23 24 0=0
ConvolutionDepthWise     convdw_152               1 1 24 25 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Split                    splitncnn_3              1 2 25 26 27
Convolution              conv_9                   1 1 27 28 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
GELU                     gelu_104                 1 1 28 29
Convolution              conv_10                  1 1 29 30 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_2                    2 1 26 30 31 0=0
Split                    splitncnn_4              1 2 31 32 33
ConvolutionDepthWise     convdw_153               1 1 33 34 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1152 7=128
Convolution              conv_11                  1 1 34 35 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
GELU                     gelu_105                 1 1 35 36
Convolution              conv_12                  1 1 36 37 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
ConvolutionDepthWise     convdw_154               1 1 37 38 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Split                    splitncnn_5              1 2 38 39 40
Reduction                mean_147                 1 1 40 41 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_6               1 1 41 42 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              conv_14                  1 1 42 43 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
HardSigmoid              hsigmoid_117             1 1 43 44 0=0.166667 1=0.5
BinaryOp                 mul_3                    2 1 39 44 45 0=2
Split                    splitncnn_6              1 2 45 46 47
Convolution              conv_15                  1 1 47 48 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
GELU                     gelu_106                 1 1 48 49
Convolution              conv_16                  1 1 49 50 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_4                    2 1 46 50 51 0=0
ConvolutionDepthWise     convdw_155               1 1 51 52 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Split                    splitncnn_7              1 2 52 53 54
Convolution              conv_17                  1 1 54 55 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
GELU                     gelu_107                 1 1 55 56
Convolution              conv_18                  1 1 56 57 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
BinaryOp                 add_5                    2 1 53 57 58 0=0
Split                    splitncnn_8              1 2 58 59 60
ConvolutionDepthWise     convdw_156               1 1 60 61 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2304 7=256
Convolution              conv_19                  1 1 61 62 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
GELU                     gelu_108                 1 1 62 63
Convolution              conv_20                  1 1 63 64 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
ConvolutionDepthWise     convdw_157               1 1 64 65 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Split                    splitncnn_9              1 2 65 66 67
Reduction                mean_148                 1 1 67 68 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_7               1 1 68 69 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              conv_22                  1 1 69 70 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSigmoid              hsigmoid_118             1 1 70 71 0=0.166667 1=0.5
BinaryOp                 mul_6                    2 1 66 71 72 0=2
Split                    splitncnn_10             1 2 72 73 74
Convolution              conv_23                  1 1 74 75 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
GELU                     gelu_109                 1 1 75 76
Convolution              conv_24                  1 1 76 77 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
BinaryOp                 add_7                    2 1 73 77 78 0=0
ConvolutionDepthWise     convdw_158               1 1 78 79 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Split                    splitncnn_11             1 2 79 80 81
Convolution              conv_25                  1 1 81 82 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
GELU                     gelu_110                 1 1 82 83
Convolution              conv_26                  1 1 83 84 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
BinaryOp                 add_8                    2 1 80 84 85 0=0
ConvolutionDepthWise     convdw_159               1 1 85 86 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Split                    splitncnn_12             1 2 86 87 88
Reduction                mean_149                 1 1 88 89 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_8               1 1 89 90 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              conv_28                  1 1 90 91 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSigmoid              hsigmoid_119             1 1 91 92 0=0.166667 1=0.5
BinaryOp                 mul_9                    2 1 87 92 93 0=2
Split                    splitncnn_13             1 2 93 94 95
Convolution              conv_29                  1 1 95 96 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
GELU                     gelu_111                 1 1 96 97
Convolution              conv_30                  1 1 97 98 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
BinaryOp                 add_10                   2 1 94 98 99 0=0
ConvolutionDepthWise     convdw_160               1 1 99 100 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 7=512
Split                    splitncnn_14             1 2 100 101 102
Convolution              conv_31                  1 1 102 103 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
GELU                     gelu_112                 1 1 103 104
Convolution              conv_32                  1 1 104 105 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
BinaryOp                 add_11                   2 1 101 105 106 0=0
Split                    splitncnn_15             1 2 106 107 108
ConvolutionDepthWise     convdw_161               1 1 108 109 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608 7=512
Convolution              conv_33                  1 1 109 110 0=1024 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
GELU                     gelu_113                 1 1 110 111
Convolution              conv_34                  1 1 111 112 0=896 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=917504
ConvolutionDepthWise     convdw_162               1 1 112 113 0=896 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=8064 7=896
Split                    splitncnn_16             1 2 113 114 115
Reduction                mean_150                 1 1 115 116 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_9               1 1 116 117 0=224 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=200704 9=1
Convolution              conv_36                  1 1 117 118 0=896 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=200704
HardSigmoid              hsigmoid_120             1 1 118 119 0=0.166667 1=0.5
BinaryOp                 mul_12                   2 1 114 119 120 0=2
Split                    splitncnn_17             1 2 120 121 122
Convolution              conv_37                  1 1 122 123 0=1792 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1605632
GELU                     gelu_114                 1 1 123 124
Convolution              conv_38                  1 1 124 125 0=896 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1605632
BinaryOp                 add_13                   2 1 121 125 126 0=0
ConvolutionDepthWise     convdw_163               1 1 126 127 0=896 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=8064 7=896
Split                    splitncnn_18             1 2 127 128 129
Convolution              conv_39                  1 1 129 130 0=1792 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1605632
GELU                     gelu_115                 1 1 130 131
Convolution              conv_40                  1 1 131 132 0=896 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1605632
BinaryOp                 add_14                   2 1 128 132 133 0=0
Convolution              conv_41                  1 1 133 134 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=229376
Split                    splitncnn_19             1 2 134 135 136
Convolution              conv_42                  1 1 107 137 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=131072
Convolution              conv_43                  1 1 59 138 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=65536
Convolution              conv_44                  1 1 32 139 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=32768
Interp                   interpolate_121          1 1 135 140 0=1 1=2.0 2=2.0 6=0
BinaryOp                 add_15                   2 1 137 140 141 0=0
Split                    splitncnn_20             1 2 141 142 143
Interp                   interpolate_122          1 1 142 144 0=1 1=2.0 2=2.0 6=0
BinaryOp                 add_16                   2 1 138 144 145 0=0
Split                    splitncnn_21             1 2 145 146 147
Interp                   interpolate_123          1 1 146 148 0=1 1=2.0 2=2.0 6=0
BinaryOp                 add_17                   2 1 139 148 149 0=0
ConvolutionDepthWise     convdw_164               1 1 136 150 0=256 1=9 11=9 12=1 13=1 14=4 2=1 3=1 4=4 5=1 6=20736 7=256
Convolution              conv_45                  1 1 150 151 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
ConvolutionDepthWise     convdw_165               1 1 143 152 0=256 1=9 11=9 12=1 13=1 14=4 2=1 3=1 4=4 5=1 6=20736 7=256
Convolution              conv_46                  1 1 152 153 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
ConvolutionDepthWise     convdw_166               1 1 147 154 0=256 1=9 11=9 12=1 13=1 14=4 2=1 3=1 4=4 5=1 6=20736 7=256
Convolution              conv_47                  1 1 154 155 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
ConvolutionDepthWise     convdw_167               1 1 149 156 0=256 1=9 11=9 12=1 13=1 14=4 2=1 3=1 4=4 5=1 6=20736 7=256
Convolution              conv_48                  1 1 156 157 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Split                    splitncnn_22             1 2 157 158 159
Convolution              conv_49                  1 1 158 160 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=0 6=36864
BinaryOp                 add_18                   2 1 155 160 161 0=0
Split                    splitncnn_23             1 2 161 162 163
Convolution              conv_50                  1 1 162 164 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=0 6=36864
BinaryOp                 add_19                   2 1 153 164 165 0=0
Split                    splitncnn_24             1 2 165 166 167
Convolution              conv_51                  1 1 166 168 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=0 6=36864
BinaryOp                 add_20                   2 1 151 168 169 0=0
ConvolutionDepthWise     convdw_168               1 1 159 170 0=64 1=9 11=9 12=1 13=1 14=4 2=1 3=1 4=4 5=1 6=5184 7=64
Convolution              conv_52                  1 1 170 171 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Split                    splitncnn_25             1 2 171 172 173
ConvolutionDepthWise     convdw_169               1 1 163 174 0=64 1=9 11=9 12=1 13=1 14=4 2=1 3=1 4=4 5=1 6=5184 7=64
Convolution              conv_53                  1 1 174 175 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Split                    splitncnn_26             1 2 175 176 177
ConvolutionDepthWise     convdw_170               1 1 167 178 0=64 1=9 11=9 12=1 13=1 14=4 2=1 3=1 4=4 5=1 6=5184 7=64
Convolution              conv_54                  1 1 178 179 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Split                    splitncnn_27             1 2 179 180 181
ConvolutionDepthWise     convdw_171               1 1 169 182 0=64 1=9 11=9 12=1 13=1 14=4 2=1 3=1 4=4 5=1 6=5184 7=64
Convolution              conv_55                  1 1 182 183 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Split                    splitncnn_28             1 2 183 184 185
Convolution              conv_56                  1 1 185 186 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Split                    splitncnn_29             1 3 186 187 188 189
Convolution              conv_57                  1 1 189 190 0=32 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=50176
Convolution              conv_58                  1 1 188 191 0=32 1=1 11=7 12=1 13=1 14=3 2=1 3=1 4=0 5=1 6=7168
Convolution              conv_59                  1 1 187 192 0=32 1=7 11=1 12=1 13=1 14=0 2=1 3=1 4=3 5=1 6=7168
BinaryOp                 add_21                   2 1 190 191 193 0=0
BinaryOp                 add_22                   2 1 193 192 194 0=0
Split                    splitncnn_30             1 3 194 195 196 197
Convolution              conv_60                  1 1 197 198 0=32 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=25600
Convolution              conv_61                  1 1 196 199 0=32 1=1 11=5 12=1 13=1 14=2 2=1 3=1 4=0 5=1 6=5120
Convolution              conv_62                  1 1 195 200 0=32 1=5 11=1 12=1 13=1 14=0 2=1 3=1 4=2 5=1 6=5120
BinaryOp                 add_23                   2 1 198 199 201 0=0
BinaryOp                 add_24                   2 1 201 200 202 0=0
Split                    splitncnn_31             1 3 202 203 204 205
Convolution              conv_63                  1 1 205 206 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_64                  1 1 204 207 0=32 1=1 11=3 12=1 13=1 14=1 2=1 3=1 4=0 5=1 6=3072
Convolution              conv_65                  1 1 203 208 0=32 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=3072
BinaryOp                 add_25                   2 1 206 207 209 0=0
BinaryOp                 add_26                   2 1 209 208 210 0=0
Convolution              convrelu_10              1 1 210 211 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
BinaryOp                 add_27                   2 1 184 211 212 0=0
Convolution              conv_67                  1 1 181 213 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Split                    splitncnn_32             1 3 213 214 215 216
Convolution              conv_68                  1 1 216 217 0=32 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=50176
Convolution              conv_69                  1 1 215 218 0=32 1=1 11=7 12=1 13=1 14=3 2=1 3=1 4=0 5=1 6=7168
Convolution              conv_70                  1 1 214 219 0=32 1=7 11=1 12=1 13=1 14=0 2=1 3=1 4=3 5=1 6=7168
BinaryOp                 add_28                   2 1 217 218 220 0=0
BinaryOp                 add_29                   2 1 220 219 221 0=0
Split                    splitncnn_33             1 3 221 222 223 224
Convolution              conv_71                  1 1 224 225 0=32 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=25600
Convolution              conv_72                  1 1 223 226 0=32 1=1 11=5 12=1 13=1 14=2 2=1 3=1 4=0 5=1 6=5120
Convolution              conv_73                  1 1 222 227 0=32 1=5 11=1 12=1 13=1 14=0 2=1 3=1 4=2 5=1 6=5120
BinaryOp                 add_30                   2 1 225 226 228 0=0
BinaryOp                 add_31                   2 1 228 227 229 0=0
Split                    splitncnn_34             1 3 229 230 231 232
Convolution              conv_74                  1 1 232 233 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_75                  1 1 231 234 0=32 1=1 11=3 12=1 13=1 14=1 2=1 3=1 4=0 5=1 6=3072
Convolution              conv_76                  1 1 230 235 0=32 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=3072
BinaryOp                 add_32                   2 1 233 234 236 0=0
BinaryOp                 add_33                   2 1 236 235 237 0=0
Convolution              convrelu_11              1 1 237 238 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
BinaryOp                 add_34                   2 1 180 238 239 0=0
Convolution              conv_78                  1 1 177 240 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Split                    splitncnn_35             1 3 240 241 242 243
Convolution              conv_79                  1 1 243 244 0=32 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=50176
Convolution              conv_80                  1 1 242 245 0=32 1=1 11=7 12=1 13=1 14=3 2=1 3=1 4=0 5=1 6=7168
Convolution              conv_81                  1 1 241 246 0=32 1=7 11=1 12=1 13=1 14=0 2=1 3=1 4=3 5=1 6=7168
BinaryOp                 add_35                   2 1 244 245 247 0=0
BinaryOp                 add_36                   2 1 247 246 248 0=0
Split                    splitncnn_36             1 3 248 249 250 251
Convolution              conv_82                  1 1 251 252 0=32 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=25600
Convolution              conv_83                  1 1 250 253 0=32 1=1 11=5 12=1 13=1 14=2 2=1 3=1 4=0 5=1 6=5120
Convolution              conv_84                  1 1 249 254 0=32 1=5 11=1 12=1 13=1 14=0 2=1 3=1 4=2 5=1 6=5120
BinaryOp                 add_37                   2 1 252 253 255 0=0
BinaryOp                 add_38                   2 1 255 254 256 0=0
Split                    splitncnn_37             1 3 256 257 258 259
Convolution              conv_85                  1 1 259 260 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_86                  1 1 258 261 0=32 1=1 11=3 12=1 13=1 14=1 2=1 3=1 4=0 5=1 6=3072
Convolution              conv_87                  1 1 257 262 0=32 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=3072
BinaryOp                 add_39                   2 1 260 261 263 0=0
BinaryOp                 add_40                   2 1 263 262 264 0=0
Convolution              convrelu_12              1 1 264 265 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
BinaryOp                 add_41                   2 1 176 265 266 0=0
Convolution              conv_89                  1 1 173 267 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Split                    splitncnn_38             1 3 267 268 269 270
Convolution              conv_90                  1 1 270 271 0=32 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=1 6=50176
Convolution              conv_91                  1 1 269 272 0=32 1=1 11=7 12=1 13=1 14=3 2=1 3=1 4=0 5=1 6=7168
Convolution              conv_92                  1 1 268 273 0=32 1=7 11=1 12=1 13=1 14=0 2=1 3=1 4=3 5=1 6=7168
BinaryOp                 add_42                   2 1 271 272 274 0=0
BinaryOp                 add_43                   2 1 274 273 275 0=0
Split                    splitncnn_39             1 3 275 276 277 278
Convolution              conv_93                  1 1 278 279 0=32 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=25600
Convolution              conv_94                  1 1 277 280 0=32 1=1 11=5 12=1 13=1 14=2 2=1 3=1 4=0 5=1 6=5120
Convolution              conv_95                  1 1 276 281 0=32 1=5 11=1 12=1 13=1 14=0 2=1 3=1 4=2 5=1 6=5120
BinaryOp                 add_44                   2 1 279 280 282 0=0
BinaryOp                 add_45                   2 1 282 281 283 0=0
Split                    splitncnn_40             1 3 283 284 285 286
Convolution              conv_96                  1 1 286 287 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Convolution              conv_97                  1 1 285 288 0=32 1=1 11=3 12=1 13=1 14=1 2=1 3=1 4=0 5=1 6=3072
Convolution              conv_98                  1 1 284 289 0=32 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=3072
BinaryOp                 add_46                   2 1 287 288 290 0=0
BinaryOp                 add_47                   2 1 290 289 291 0=0
Convolution              convrelu_13              1 1 291 292 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048 9=1
BinaryOp                 add_48                   2 1 172 292 293 0=0
Interp                   interpolate_124          1 1 212 294 0=1 1=8.0 2=8.0 6=0
Interp                   interpolate_125          1 1 239 295 0=1 1=4.0 2=4.0 6=0
Interp                   interpolate_126          1 1 266 296 0=1 1=2.0 2=2.0 6=0
Concat                   cat_1                    4 1 294 295 296 293 297 0=0
Convolution              convrelu_14              1 1 297 298 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Deconvolution            deconvrelu_0             1 1 298 299 0=64 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=16384 9=1
Deconvolution            deconv_102               1 1 299 300 0=1 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=0 6=256
BinaryOp                 add_49                   1 1 300 301 0=0 1=1 2=0.451004
Sigmoid                  sigmoid_145              1 1 301 out0
