7767517
217 255
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 9=1
Split                    splitncnn_0              1 2 1 2 3
Convolution              convrelu_1               1 1 2 4 0=8 1=2 11=2 12=1 13=1 2=1 3=1 4=-233 5=1 6=512 9=1
Convolution              convrelu_2               1 1 4 5 0=16 1=2 11=2 12=1 13=1 2=1 3=1 4=-233 5=1 6=512 9=1
Padding                  pad_109                  1 1 3 6 0=0 1=1 2=0 3=1 4=0 5=-3.402823e+38 6=0
Pooling                  maxpool2d_108            1 1 6 7 0=0 1=2 11=2 12=1 13=0 2=1 3=0 5=1
Concat                   cat_0                    2 1 7 5 8 0=0
Convolution              convrelu_3               1 1 8 9 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608 9=1
Convolution              convrelu_4               1 1 9 10 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512 9=1
ConvolutionDepthWise     convdw_144               1 1 10 11 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
Split                    splitncnn_1              1 2 11 12 13
Reduction                mean_139                 1 1 13 14 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_5               1 1 14 15 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 9=1
Convolution              conv_6                   1 1 15 16 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
HardSigmoid              hsigmoid_89              1 1 16 17 0=0.166667 1=0.5
BinaryOp                 mul_0                    2 1 12 17 18 0=2
Split                    splitncnn_2              1 2 18 19 20
Convolution              conv_7                   1 1 20 21 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
GELU                     gelu_76                  1 1 21 22
Convolution              conv_8                   1 1 22 23 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
BinaryOp                 add_1                    2 1 19 23 24 0=0
ConvolutionDepthWise     convdw_145               1 1 24 25 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
Split                    splitncnn_3              1 2 25 26 27
Convolution              conv_9                   1 1 27 28 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
GELU                     gelu_77                  1 1 28 29
Convolution              conv_10                  1 1 29 30 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
BinaryOp                 add_2                    2 1 26 30 31 0=0
Split                    splitncnn_4              1 2 31 32 33
ConvolutionDepthWise     convdw_146               1 1 33 34 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=288 7=32
Convolution              conv_11                  1 1 34 35 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
GELU                     gelu_78                  1 1 35 36
Convolution              conv_12                  1 1 36 37 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
ConvolutionDepthWise     convdw_147               1 1 37 38 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Split                    splitncnn_5              1 2 38 39 40
Reduction                mean_140                 1 1 40 41 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_6               1 1 41 42 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Convolution              conv_14                  1 1 42 43 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSigmoid              hsigmoid_90              1 1 43 44 0=0.166667 1=0.5
BinaryOp                 mul_3                    2 1 39 44 45 0=2
Split                    splitncnn_6              1 2 45 46 47
Convolution              conv_15                  1 1 47 48 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
GELU                     gelu_79                  1 1 48 49
Convolution              conv_16                  1 1 49 50 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
BinaryOp                 add_4                    2 1 46 50 51 0=0
ConvolutionDepthWise     convdw_148               1 1 51 52 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Split                    splitncnn_7              1 2 52 53 54
Convolution              conv_17                  1 1 54 55 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
GELU                     gelu_80                  1 1 55 56
Convolution              conv_18                  1 1 56 57 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
BinaryOp                 add_5                    2 1 53 57 58 0=0
Split                    splitncnn_8              1 2 58 59 60
ConvolutionDepthWise     convdw_149               1 1 60 61 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 7=48
Convolution              conv_19                  1 1 61 62 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
GELU                     gelu_81                  1 1 62 63
Convolution              conv_20                  1 1 63 64 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
ConvolutionDepthWise     convdw_150               1 1 64 65 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Split                    splitncnn_9              1 2 65 66 67
Reduction                mean_141                 1 1 67 68 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_7               1 1 68 69 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Convolution              conv_22                  1 1 69 70 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
HardSigmoid              hsigmoid_91              1 1 70 71 0=0.166667 1=0.5
BinaryOp                 mul_6                    2 1 66 71 72 0=2
Split                    splitncnn_10             1 2 72 73 74
Convolution              conv_23                  1 1 74 75 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
GELU                     gelu_82                  1 1 75 76
Convolution              conv_24                  1 1 76 77 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_7                    2 1 73 77 78 0=0
ConvolutionDepthWise     convdw_151               1 1 78 79 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Split                    splitncnn_11             1 2 79 80 81
Convolution              conv_25                  1 1 81 82 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
GELU                     gelu_83                  1 1 82 83
Convolution              conv_26                  1 1 83 84 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_8                    2 1 80 84 85 0=0
ConvolutionDepthWise     convdw_152               1 1 85 86 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Split                    splitncnn_12             1 2 86 87 88
Reduction                mean_142                 1 1 88 89 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_8               1 1 89 90 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Convolution              conv_28                  1 1 90 91 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
HardSigmoid              hsigmoid_92              1 1 91 92 0=0.166667 1=0.5
BinaryOp                 mul_9                    2 1 87 92 93 0=2
Split                    splitncnn_13             1 2 93 94 95
Convolution              conv_29                  1 1 95 96 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
GELU                     gelu_84                  1 1 96 97
Convolution              conv_30                  1 1 97 98 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_10                   2 1 94 98 99 0=0
ConvolutionDepthWise     convdw_153               1 1 99 100 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Split                    splitncnn_14             1 2 100 101 102
Convolution              conv_31                  1 1 102 103 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
GELU                     gelu_85                  1 1 103 104
Convolution              conv_32                  1 1 104 105 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_11                   2 1 101 105 106 0=0
Split                    splitncnn_15             1 2 106 107 108
ConvolutionDepthWise     convdw_154               1 1 108 109 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=576 7=64
Convolution              conv_33                  1 1 109 110 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
GELU                     gelu_86                  1 1 110 111
Convolution              conv_34                  1 1 111 112 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=20480
ConvolutionDepthWise     convdw_155               1 1 112 113 0=160 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1440 7=160
Split                    splitncnn_16             1 2 113 114 115
Reduction                mean_143                 1 1 115 116 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_9               1 1 116 117 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6400 9=1
Convolution              conv_36                  1 1 117 118 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6400
HardSigmoid              hsigmoid_93              1 1 118 119 0=0.166667 1=0.5
BinaryOp                 mul_12                   2 1 114 119 120 0=2
Split                    splitncnn_17             1 2 120 121 122
Convolution              conv_37                  1 1 122 123 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=51200
GELU                     gelu_87                  1 1 123 124
Convolution              conv_38                  1 1 124 125 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=51200
BinaryOp                 add_13                   2 1 121 125 126 0=0
ConvolutionDepthWise     convdw_156               1 1 126 127 0=160 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1440 7=160
Split                    splitncnn_18             1 2 127 128 129
Convolution              conv_39                  1 1 129 130 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=51200
GELU                     gelu_88                  1 1 130 131
Convolution              conv_40                  1 1 131 132 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=51200
BinaryOp                 add_14                   2 1 128 132 133 0=0
Convolution              conv_41                  1 1 133 134 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=10240
Split                    splitncnn_19             1 3 134 135 136 137
Pooling                  gap_68                   1 1 137 138 0=1 4=1
Convolution              convrelu_10              1 1 138 139 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Convolution              conv_43                  1 1 139 140 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Reshape                  reshape_131              1 1 140 141 0=1 1=1 2=-1
BinaryOp                 mul_15                   1 1 141 142 0=2 1=1 2=1.2
HardSigmoid              hsigmoid_94              1 1 142 143 0=0.166667 1=0.5
BinaryOp                 mul_16                   2 1 135 143 144 0=2
BinaryOp                 add_17                   2 1 136 144 145 0=0
Split                    splitncnn_20             1 2 145 146 147
Convolution              conv_44                  1 1 107 148 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=4096
Split                    splitncnn_21             1 3 148 149 150 151
Pooling                  gap_69                   1 1 151 152 0=1 4=1
Convolution              convrelu_11              1 1 152 153 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Convolution              conv_46                  1 1 153 154 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Reshape                  reshape_132              1 1 154 155 0=1 1=1 2=-1
BinaryOp                 mul_18                   1 1 155 156 0=2 1=1 2=1.2
HardSigmoid              hsigmoid_95              1 1 156 157 0=0.166667 1=0.5
Convolution              conv_47                  1 1 59 158 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=3072
Split                    splitncnn_22             1 3 158 159 160 161
Pooling                  gap_70                   1 1 161 162 0=1 4=1
Convolution              convrelu_12              1 1 162 163 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Convolution              conv_49                  1 1 163 164 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Reshape                  reshape_133              1 1 164 165 0=1 1=1 2=-1
BinaryOp                 mul_19                   1 1 165 166 0=2 1=1 2=1.2
HardSigmoid              hsigmoid_96              1 1 166 167 0=0.166667 1=0.5
Convolution              conv_50                  1 1 32 168 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=2048
Split                    splitncnn_23             1 3 168 169 170 171
Pooling                  gap_71                   1 1 171 172 0=1 4=1
Convolution              convrelu_13              1 1 172 173 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 9=1
Convolution              conv_52                  1 1 173 174 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Reshape                  reshape_134              1 1 174 175 0=1 1=1 2=-1
BinaryOp                 mul_20                   1 1 175 176 0=2 1=1 2=1.2
HardSigmoid              hsigmoid_97              1 1 176 177 0=0.166667 1=0.5
Interp                   interpolate_102          1 1 146 178 0=1 1=2.0 2=2.0 6=0
BinaryOp                 mul_21                   2 1 149 157 179 0=2
BinaryOp                 add_22                   2 1 150 179 180 0=0
BinaryOp                 add_23                   2 1 180 178 181 0=0
Split                    splitncnn_24             1 2 181 182 183
Interp                   interpolate_103          1 1 182 184 0=1 1=2.0 2=2.0 6=0
BinaryOp                 mul_24                   2 1 159 167 185 0=2
BinaryOp                 add_25                   2 1 160 185 186 0=0
BinaryOp                 add_26                   2 1 186 184 187 0=0
Split                    splitncnn_25             1 2 187 188 189
Interp                   interpolate_104          1 1 188 190 0=1 1=2.0 2=2.0 6=0
BinaryOp                 mul_27                   2 1 169 177 191 0=2
BinaryOp                 add_28                   2 1 170 191 192 0=0
BinaryOp                 add_29                   2 1 192 190 193 0=0
ConvolutionDepthWise     convdw_157               1 1 147 194 0=64 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1600 7=64
Convolution              conv_53                  1 1 194 195 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
Split                    splitncnn_26             1 3 195 196 197 198
Pooling                  gap_72                   1 1 198 199 0=1 4=1
Convolution              convrelu_14              1 1 199 200 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=1
Convolution              conv_55                  1 1 200 201 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Reshape                  reshape_135              1 1 201 202 0=1 1=1 2=-1
BinaryOp                 mul_30                   1 1 202 203 0=2 1=1 2=1.2
HardSigmoid              hsigmoid_98              1 1 203 204 0=0.166667 1=0.5
BinaryOp                 mul_31                   2 1 196 204 205 0=2
BinaryOp                 add_32                   2 1 197 205 206 0=0
ConvolutionDepthWise     convdw_158               1 1 183 207 0=64 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1600 7=64
Convolution              conv_56                  1 1 207 208 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
Split                    splitncnn_27             1 3 208 209 210 211
Pooling                  gap_73                   1 1 211 212 0=1 4=1
Convolution              convrelu_15              1 1 212 213 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=1
Convolution              conv_58                  1 1 213 214 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Reshape                  reshape_136              1 1 214 215 0=1 1=1 2=-1
BinaryOp                 mul_33                   1 1 215 216 0=2 1=1 2=1.2
HardSigmoid              hsigmoid_99              1 1 216 217 0=0.166667 1=0.5
BinaryOp                 mul_34                   2 1 209 217 218 0=2
BinaryOp                 add_35                   2 1 210 218 219 0=0
ConvolutionDepthWise     convdw_159               1 1 189 220 0=64 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1600 7=64
Convolution              conv_59                  1 1 220 221 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
Split                    splitncnn_28             1 3 221 222 223 224
Pooling                  gap_74                   1 1 224 225 0=1 4=1
Convolution              convrelu_16              1 1 225 226 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=1
Convolution              conv_61                  1 1 226 227 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Reshape                  reshape_137              1 1 227 228 0=1 1=1 2=-1
BinaryOp                 mul_36                   1 1 228 229 0=2 1=1 2=1.2
HardSigmoid              hsigmoid_100             1 1 229 230 0=0.166667 1=0.5
BinaryOp                 mul_37                   2 1 222 230 231 0=2
BinaryOp                 add_38                   2 1 223 231 232 0=0
ConvolutionDepthWise     convdw_160               1 1 193 233 0=64 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1600 7=64
Convolution              conv_62                  1 1 233 234 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1024
Split                    splitncnn_29             1 3 234 235 236 237
Pooling                  gap_75                   1 1 237 238 0=1 4=1
Convolution              convrelu_17              1 1 238 239 0=4 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=1
Convolution              conv_64                  1 1 239 240 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Reshape                  reshape_138              1 1 240 241 0=1 1=1 2=-1
BinaryOp                 mul_39                   1 1 241 242 0=2 1=1 2=1.2
HardSigmoid              hsigmoid_101             1 1 242 243 0=0.166667 1=0.5
BinaryOp                 mul_40                   2 1 235 243 244 0=2
BinaryOp                 add_41                   2 1 236 244 245 0=0
Interp                   interpolate_105          1 1 206 246 0=1 1=8.0 2=8.0 6=0
Interp                   interpolate_106          1 1 219 247 0=1 1=4.0 2=4.0 6=0
Interp                   interpolate_107          1 1 232 248 0=1 1=2.0 2=2.0 6=0
Concat                   cat_1                    4 1 246 247 248 245 249 0=0
Convolution              convrelu_18              1 1 249 250 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Deconvolution            deconvrelu_0             1 1 250 251 0=16 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=1024 9=1
Deconvolution            deconv_67                1 1 251 252 0=1 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=0 6=64
BinaryOp                 add_42                   1 1 252 253 0=0 1=1 2=0.691356
Sigmoid                  sigmoid_130              1 1 253 out0
