7767517
88 98
Input                    in0                      0 1 in0
Convolution              conv_4                   1 1 in0 1 0=24 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=648
GELU                     gelu_32                  1 1 1 2
Convolution              conv_5                   1 1 2 3 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=10368
ConvolutionDepthWise     convdw_60                1 1 3 4 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Split                    splitncnn_0              1 2 4 5 6
Reduction                mean_52                  1 1 6 7 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_0               1 1 7 8 0=12 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576 9=1
Convolution              conv_7                   1 1 8 9 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=576
HardSigmoid              hsigmoid_42              1 1 9 10 0=0.166667 1=0.5
BinaryOp                 mul_0                    2 1 5 10 11 0=2
Split                    splitncnn_1              1 2 11 12 13
Convolution              conv_8                   1 1 13 14 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
GELU                     gelu_33                  1 1 14 15
Convolution              conv_9                   1 1 15 16 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
BinaryOp                 add_1                    2 1 12 16 17 0=0
ConvolutionDepthWise     convdw_61                1 1 17 18 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Split                    splitncnn_2              1 2 18 19 20
Convolution              conv_10                  1 1 20 21 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
GELU                     gelu_34                  1 1 21 22
Convolution              conv_11                  1 1 22 23 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
BinaryOp                 add_2                    2 1 19 23 24 0=0
ConvolutionDepthWise     convdw_62                1 1 24 25 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Convolution              conv_12                  1 1 25 26 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
GELU                     gelu_35                  1 1 26 27
Convolution              conv_13                  1 1 27 28 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
ConvolutionDepthWise     convdw_63                1 1 28 29 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
Split                    splitncnn_3              1 2 29 30 31
Reduction                mean_53                  1 1 31 32 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_1               1 1 32 33 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              conv_15                  1 1 33 34 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSigmoid              hsigmoid_43              1 1 34 35 0=0.166667 1=0.5
BinaryOp                 mul_3                    2 1 30 35 36 0=2
Split                    splitncnn_4              1 2 36 37 38
Convolution              conv_16                  1 1 38 39 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
GELU                     gelu_36                  1 1 39 40
Convolution              conv_17                  1 1 40 41 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
BinaryOp                 add_4                    2 1 37 41 42 0=0
ConvolutionDepthWise     convdw_64                1 1 42 43 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
Split                    splitncnn_5              1 2 43 44 45
Convolution              conv_18                  1 1 45 46 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
GELU                     gelu_37                  1 1 46 47
Convolution              conv_19                  1 1 47 48 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
BinaryOp                 add_5                    2 1 44 48 49 0=0
ConvolutionDepthWise     convdw_65                1 1 49 50 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=1 4=1 5=1 6=864 7=96
Convolution              conv_20                  1 1 50 51 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
GELU                     gelu_38                  1 1 51 52
Convolution              conv_21                  1 1 52 53 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=30720
ConvolutionDepthWise     convdw_66                1 1 53 54 0=160 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1440 7=160
Split                    splitncnn_6              1 2 54 55 56
Reduction                mean_54                  1 1 56 57 0=3 1=0 -23303=2,1,2 4=1 5=1
Convolution              convrelu_2               1 1 57 58 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6400 9=1
Convolution              conv_23                  1 1 58 59 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6400
HardSigmoid              hsigmoid_44              1 1 59 60 0=0.166667 1=0.5
BinaryOp                 mul_6                    2 1 55 60 61 0=2
Split                    splitncnn_7              1 2 61 62 63
Convolution              conv_24                  1 1 63 64 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=51200
GELU                     gelu_39                  1 1 64 65
Convolution              conv_25                  1 1 65 66 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=51200
BinaryOp                 add_7                    2 1 62 66 67 0=0
ConvolutionDepthWise     convdw_67                1 1 67 68 0=160 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1440 7=160
Split                    splitncnn_8              1 2 68 69 70
Convolution              conv_26                  1 1 70 71 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=51200
GELU                     gelu_40                  1 1 71 72
Convolution              conv_27                  1 1 72 73 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=51200
BinaryOp                 add_8                    2 1 69 73 74 0=0
ConvolutionDepthWise     convdw_68                1 1 74 75 0=160 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1440 7=160
Split                    splitncnn_9              1 2 75 76 77
Convolution              conv_28                  1 1 77 78 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=51200
GELU                     gelu_41                  1 1 78 79
Convolution              conv_29                  1 1 79 80 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=51200
BinaryOp                 add_9                    2 1 76 80 81 0=0
Pooling                  avgpool2d_31             1 1 81 82 0=1 1=2 11=3 12=3 13=0 2=2 3=0 5=1 6=0
Squeeze                  squeeze_55               1 1 82 83 -23303=1,1
ExpandDims               unsqueeze_58             1 1 83 84 -23303=1,1
ConvolutionDepthWise     convdw_69                1 1 84 85 0=160 1=5 11=1 12=1 13=1 14=0 2=1 3=1 4=2 5=0 6=800 7=160
Squeeze                  squeeze_56               1 1 85 86 -23303=1,1
BatchNorm                bn_2                     1 1 86 87 0=160 1=1.000000e-05
HardSwish                hswish_45                1 1 87 88 0=0.166667 1=0.5
ExpandDims               unsqueeze_59             1 1 88 89 -23303=1,1
Convolution              conv_30                  1 1 89 90 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=25600
Squeeze                  squeeze_57               1 1 90 91 -23303=1,1
BatchNorm                bn_3                     1 1 91 92 0=160 1=1.000000e-05
HardSwish                hswish_46                1 1 92 93 0=0.166667 1=0.5
Permute                  permute_51               1 1 93 94 0=1
Gemm                     gemm_0                   1 1 94 95 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=80 9=160
Gemm                     gemm_1                   1 1 95 96 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=6906 9=80
Softmax                  softmax_50               1 1 96 out0 0=1 1=1
